Repository: vanyasem/InfANT
Catalog: antivirus/LanguageResources.*.resx
Languages: ru

source: About InfANT:
ru: О InfANT:

# amount_of_files_scanned
source: Amount of files scanned (n of N):
ru: Кол-во проверенных файлов (n из N):

source: Cancel
ru: Отменить

# cant_scan_no_access
source: Can't scan the file. It may be corrupded, missing or protected.
ru: Проблема при сканировании этого файла. Он может быть поврежден, перемещен или защищен.

source: clear
ru: безопасен

# Computer_is_INFECTED
source: Your computer is INFECTED
ru: Компьютер ЗАРАЖЁН!

# Computer_is_partially_safe
source: Your computer is partially safe
ru: Компьютер может быть под угрозой

# Computer_is_safe
source: Your computer is safe
ru: Компьютер в безопасности

source: error
ru: ошибка

# IFBTN_SCAN
source: Scan
ru: Начать сканирование

source: InfANT* Antivirus Scanner
ru: Антивирусный сканер InfANT*

# infant_was_released
source: InfANT was released in early 2016
ru: InfANT был выпущен в начале 2016го

source: INFECTED
ru: ЗАРАЖЁН!

# intfant_explanation
source: *Inf = INFinity; ANT = A hard working (ant-like) ANTivirus
ru: *Inf = INFinity (бесконечность); ANT (муравей) = трудолюбивый (как муравей) ANTivirus

# it_was_developed_by_students
source: It was developed by a group of Russian students
ru: Он был разработан группой русских школьников.

# no_scans_performed
source: No scans were performed!
ru: Сканирований не выполнялось.

# no_viruses_found
source: No viruses found! Hooray!
ru: Вирусов не обнаружено! Ура!

source: Oops!
ru: Упс!

source: Path:
ru: Путь:

# r_u_sure
source: Are you sure?
ru: Вы уверены?

source: Selected path:
ru: Выбранный путь:

# select_scan_to_see_detailed_info
source: Select the scan in the tree to see the detailed information about it
ru: Выберите сканирование в дереве, чтобы просмотреть подробную информацию о нём.

# select_virus_to_see_detailed_info
source: Select the virus in the tree to see the detailed information about it
ru: Выберите вирус в дереве, чтобы просмотреть подробную информацию о нём.

# susp
source: suspicious
ru: подозрительно

source: This file is:
ru: Этот файл:

source: This file is INFECTED
ru: Этот файл ЗАРАЖЁН!

# this_file_looks_susp
source: This file looks suspicious
ru: Этот файл может быть использован для нанесения вреда компьютеру.

source: unscanned
ru: не проверен

source: unselected
ru: не выбран

source: Version:
ru: Версия:

# will_delete_the_file_PERMANENTLY_This_cannot_be_undone_Are_you_sure
source: This action will delete the file PERMANENTLY. This cannot be undone. Are you sure you want to proceed?
ru: Это действие удалит ЗАРАЖЁННЫЙ ФАЙЛ. Эту операцию невозможно отменить. Вы уверены?

# will_delete_your_SCANS_log_cannot_be_undone_Are_you_sure
source: This will delete your SCANS log PERMANENTLY. This cannot be undone. Are you sure you want to proceed?
ru: Это действие удалит историю сканирований. Эту операцию невозможно отменить. Вы уверены?

# will_delete_your_VIRUSES_log_cannot_be_undone_Are_you_sure
source: This will delete your VIRUSES log PERMANENTLY. This cannot be undone. Are you sure you want to proceed?
ru: Это действие удалит историю найденных вирусов. Эту операцию невозможно отменить. Вы уверены?

# IFBTN_scansmall
source: Scan
ru: Сканировать

source: looks
ru: выглядит

# protect
source: 1. Don't download unofficial and/or pirated software. 2. Don't open binaries or Microsoft Office macros from emails. 3. Backup important files on dedicated / cloud storages. 4. Disable autorun from external drives. 5. Don't use public networks without VPN connection, don't set them as trusted. 6. Disable Remote Desktop Connection and deny other PCs from writing to your shared folders.
ru: 1. Не устанавливайте неофициальное и/или пиратское программное обеспечение. 2. Не запускайте исполняемые файлы и документы Microsoft Office из Email. 3. Делайте резервные копии важных файлов на удалённых / облачных дисках. 4. Отключите автозапуск с переносных устройств. 5. Не используйте публичные сети без VPN и не помечайте их как "Домашние". 6. Отключите "Удалённый Доступ к Компьютеру" и отключите локальным машинам доступ к файлам на компьютере.

# cant_connect_to_internet
source: Can't connect to the Internet!
ru: Не получается подключиться к интернету!

# cant_save_database_no_permission
source: Couldn't write the database to disk! It looks like you have no access to the folder or the file is in use.
ru: Ошибка при сохранении датабазы на диск! Возможно, она используются или у InfANT нет доступа к папке.

# cant_save_logs_no_permissions
source: Can't save logs to disk! They are probably in use or InfANT has no premissions to save there.
ru: Ошибка при сохранении истории на диск! Возможно, они используются или у InfANT нет доступа к папке.

# Logs_werent_found_do_in_launcher_restart
source: Logs weren't found! Please, don't delete them by yourself, to do it press "Fix" in launcher. Relaunch the application!
ru: История не была найдена! Пожалуйтса, не удаляйте её вручную, делайте это с помощью кнопки "починить" в лаунчере. Перезапустите InfANT!

source: No databases found!
ru: Датабазы не были найдены!

# no_internet_cant_update_database_changelog
source: Looks like you have no internet, databases and changelog weren't updated
ru: Из-за проблем с подключением к интернету не удалось обновить датабазы и список изменений.

# no_internet_no_cahced_database_useless
source: Looks like you have no internet connection and no cached databases on your PC. Without them antivirus is completely useless!
ru: Не удаётся подключиться к серверу, а локальная копия датабаз отсутствует. Без датабаз антивирус полностью бесполезен!

# open_launcher_instead
source: Open "_Launcher.exe" instead!
ru: Запускайте "_Launcher.exe"!

# cant_delete_no_rights_or_deleted_want_remove_log_entry
source: Can't delete the file. InfANT has no rights to access it or it's already deleted. Do you want to remove it from the log?
ru: Ошибка при удалении файла. У InfANT недостаточно полномочий для удаления или файл уже был удалён. Хотите ли вы убрать его из списка угроз?

# menu_exit
source: Exit
ru: Закрыть

# menu_fast
source: Fast-Scan
ru: Быстрая проверка

# menu_open
source: Open
ru: Открыть
